Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_adc.h
/**
  * @brief    Set ACQ2 Sampling Time
  * @rmtoll   ACQ2_CR    SMTS    FL_ADC_SetACQ2SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ2SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ2_CR, ADC_ACQ2_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ2 Sampling Time
  * @rmtoll   ACQ2_CR    SMTS    FL_ADC_GeACQ2SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GeACQ2SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ2_CR, ADC_ACQ2_CR_SMTS_Msk));
}

/**
  * @brief    Set ACQ3 Channel
  * @rmtoll   ACQ3_CR    CHSEL    FL_ADC_SetACQ3ChannelSelect
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH0
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH1
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH2
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH3
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH4
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH5
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH6
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH7
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH8
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH9
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH10
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH11
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH12
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH13
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH14
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH15
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH16
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH17
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH18
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH19
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH20
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH21
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH22
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH23
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_TS
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_AVREF
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_DAC
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_TSICAP
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_VREFP
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_VREFN_FAST
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_VREFN_SLOW
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ3ChannelSelect(ADC_Type *ADCx, uint32_t channel)
{
    MODIFY_REG(ADCx->ACQ3_CR, ADC_ACQ3_CR_CHSEL_Msk, channel);
}

/**
  * @brief    Read ACQ3 Channel
  * @rmtoll   ACQ3_CR    CHSEL    FL_ADC_GetACQ3ChannelSelect
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH0
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH1
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH2
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH3
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH4
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH5
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH6
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH7
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH8
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH9
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH10
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH11
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH12
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH13
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH14
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH15
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH16
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH17
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH18
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH19
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH20
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH21
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH22
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_EXTERNAL_CH23
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_TS
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_AVREF
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_DAC
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_TSICAP
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_VREFP
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_VREFN_FAST
  *           @arg @ref FL_ADC_ACQ_SELECT_CHANNEL_INTERNAL_VREFN_SLOW
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ3ChannelSelect(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ3_CR, ADC_ACQ3_CR_CHSEL_Msk));
}

/**
  * @brief    Set ACQ3 Trigger Source
  * @rmtoll   ACQ3_CR    TRIGSEL    FL_ADC_SetACQ3TriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ_TRGI_SOFE_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_ATIM_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_ATIM_TRGO2
  *           @arg @ref FL_ADC_ACQ_TRGI_BSTIM_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_LPTIM_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_RTC_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU00_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU01_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU02_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU03_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU04_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU05_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU06_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU07_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU10_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU11_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU12_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU13_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU14_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU15_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU16_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU17_TRGO
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ3TriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->ACQ3_CR, ADC_ACQ3_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get ACQ3 Trigger Source
  * @rmtoll   ACQ3_CR    TRIGSEL    FL_ADC_GetACQ3TriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ_TRGI_SOFE_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_ATIM_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_ATIM_TRGO2
  *           @arg @ref FL_ADC_ACQ_TRGI_BSTIM_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_LPTIM_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_RTC_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU00_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU01_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU02_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU03_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU04_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU05_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU06_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU07_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU10_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU11_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU12_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU13_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU14_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU15_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU16_TRGO
  *           @arg @ref FL_ADC_ACQ_TRGI_TAU17_TRGO
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ3TriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ3_CR, ADC_ACQ3_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set ACQ3 Sampling Time
  * @rmtoll   ACQ3_CR    SMTS    FL_ADC_SetACQ3SamplingTime
  * @param    ADCx ADC instance
  * @param    time This parameter can be one of the following values:
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetACQ3SamplingTime(ADC_Type *ADCx, uint32_t time)
{
    MODIFY_REG(ADCx->ACQ3_CR, ADC_ACQ3_CR_SMTS_Msk, time);
}

/**
  * @brief    Read ACQ3 Sampling Time
  * @rmtoll   ACQ3_CR    SMTS    FL_ADC_GetACQ3SamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_ACQ_SAMPLING_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GetACQ3SamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->ACQ3_CR, ADC_ACQ3_CR_SMTS_Msk));
}

/**
  * @brief    Set Fast Channel Sample time
  * @rmtoll   SCANACQ_CR    SMTS_FAST    FL_ADC_SetSCANACQFastChannelSamplingTime
  * @param    ADCx ADC instance
  * @param    fasttime This parameter can be one of the following values:
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetSCANACQFastChannelSamplingTime(ADC_Type *ADCx, uint32_t fasttime)
{
    MODIFY_REG(ADCx->SCANACQ_CR, ADC_SCANACQ_CR_SMTS_FAST_Msk, fasttime);
}

/**
  * @brief    Read Fast Channel Sample time
  * @rmtoll   SCANACQ_CR    SMTS_FAST    FL_ADC_GetSCANACQFastChannelSamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_FAST_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GetSCANACQFastChannelSamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->SCANACQ_CR, ADC_SCANACQ_CR_SMTS_FAST_Msk));
}

/**
  * @brief    Set SCAN ACQ Trigger Source
  * @rmtoll   SCANACQ_CR    TRIGSEL    FL_ADC_SetSCANACQTriggerSource
  * @param    ADCx ADC instance
  * @param    source This parameter can be one of the following values:
  *           @arg @ref FL_ADC_SCANACQ_TRGI_SOFE_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM_TRGO2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_BSTIM_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_LPTIM_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_RTC_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_0
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_1
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_3
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_4
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_5
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_6
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_7
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_0
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_1
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_3
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_4
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_5
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_6
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_7
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetSCANACQTriggerSource(ADC_Type *ADCx, uint32_t source)
{
    MODIFY_REG(ADCx->SCANACQ_CR, ADC_SCANACQ_CR_TRIGSEL_Msk, source);
}

/**
  * @brief    Get SCAN ACQ Trigger Source
  * @rmtoll   SCANACQ_CR    TRIGSEL    FL_ADC_GetSCANACQTriggerSource
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_SCANACQ_TRGI_SOFE_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_ATIM_TRGO2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_BSTIM_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_LPTIM_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_RTC_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_COMP1_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_COMP2_TRGO
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_0
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_1
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_3
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_4
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_5
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_6
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG0_7
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_0
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_1
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_2
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_3
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_4
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_5
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_6
  *           @arg @ref FL_ADC_SCANACQ_TRGI_TAU0_TRG1_7
  */
__STATIC_INLINE uint32_t FL_ADC_GetSCANACQTriggerSource(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->SCANACQ_CR, ADC_SCANACQ_CR_TRIGSEL_Msk));
}

/**
  * @brief    Set Slow Channel Sample time
  * @rmtoll   SCANACQ_CR    SMTS_SLOW    FL_ADC_SetSCANACQSlowChannelSamplingTime
  * @param    ADCx ADC instance
  * @param    lowtime This parameter can be one of the following values:
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_512_ADCCLK
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_SetSCANACQSlowChannelSamplingTime(ADC_Type *ADCx, uint32_t lowtime)
{
    MODIFY_REG(ADCx->SCANACQ_CR, ADC_SCANACQ_CR_SMTS_SLOW_Msk, lowtime);
}

/**
  * @brief    Read Slow Channel Sample time
  * @rmtoll   SCANACQ_CR    SMTS_SLOW    FL_ADC_GetSCANACQSlowChannelSamplingTime
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_1_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_2_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_4_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_8_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_12_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_16_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_32_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_64_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_80_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_96_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_128_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_160_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_192_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_256_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_320_ADCCLK
  *           @arg @ref FL_ADC_SCANACQ_SAMPLING_LOW_TIME_512_ADCCLK
  */
__STATIC_INLINE uint32_t FL_ADC_GetSCANACQSlowChannelSamplingTime(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->SCANACQ_CR, ADC_SCANACQ_CR_SMTS_SLOW_Msk));
}

