Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_adc.h
/**
  * @brief    Get ADC End of Conversion Flag
  * @rmtoll   CHISR    IF    FL_ADC_IsActiveFlag_ChannelEndOfConversion
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_EXTERNAL_CH0
  *           @arg @ref FL_ADC_EXTERNAL_CH1
  *           @arg @ref FL_ADC_EXTERNAL_CH2
  *           @arg @ref FL_ADC_EXTERNAL_CH3
  *           @arg @ref FL_ADC_EXTERNAL_CH4
  *           @arg @ref FL_ADC_EXTERNAL_CH5
  *           @arg @ref FL_ADC_EXTERNAL_CH6
  *           @arg @ref FL_ADC_EXTERNAL_CH7
  *           @arg @ref FL_ADC_EXTERNAL_CH8
  *           @arg @ref FL_ADC_EXTERNAL_CH9
  *           @arg @ref FL_ADC_EXTERNAL_CH10
  *           @arg @ref FL_ADC_EXTERNAL_CH11
  *           @arg @ref FL_ADC_EXTERNAL_CH12
  *           @arg @ref FL_ADC_EXTERNAL_CH13
  *           @arg @ref FL_ADC_EXTERNAL_CH14
  *           @arg @ref FL_ADC_EXTERNAL_CH15
  *           @arg @ref FL_ADC_EXTERNAL_CH16
  *           @arg @ref FL_ADC_EXTERNAL_CH17
  *           @arg @ref FL_ADC_EXTERNAL_CH18
  *           @arg @ref FL_ADC_EXTERNAL_CH19
  *           @arg @ref FL_ADC_EXTERNAL_CH20
  *           @arg @ref FL_ADC_EXTERNAL_CH21
  *           @arg @ref FL_ADC_EXTERNAL_CH22
  *           @arg @ref FL_ADC_EXTERNAL_CH23
  *           @arg @ref FL_ADC_INTERNAL_TS
  *           @arg @ref FL_ADC_INTERNAL_AVREF
  *           @arg @ref FL_ADC_INTERNAL_DAC
  *           @arg @ref FL_ADC_INTERNAL_TSICAP
  *           @arg @ref FL_ADC_INTERNAL_VREFP
  *           @arg @ref FL_ADC_INTERNAL_VREFN_FAST
  *           @arg @ref FL_ADC_INTERNAL_VREFN_SLOW
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_ADC_IsActiveFlag_ChannelEndOfConversion(ADC_Type *ADCx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(ADCx->CHISR, ((channel & 0xffffffff) << 0x0U)) == ((channel & 0xffffffff) << 0x0U));
}

/**
  * @brief    Clear ADC End Of Conversion Flag
  * @rmtoll   CHISR    IF    FL_ADC_ClearFlag_ChannelEndOfConversion
  * @param    ADCx ADC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_ADC_EXTERNAL_CH0
  *           @arg @ref FL_ADC_EXTERNAL_CH1
  *           @arg @ref FL_ADC_EXTERNAL_CH2
  *           @arg @ref FL_ADC_EXTERNAL_CH3
  *           @arg @ref FL_ADC_EXTERNAL_CH4
  *           @arg @ref FL_ADC_EXTERNAL_CH5
  *           @arg @ref FL_ADC_EXTERNAL_CH6
  *           @arg @ref FL_ADC_EXTERNAL_CH7
  *           @arg @ref FL_ADC_EXTERNAL_CH8
  *           @arg @ref FL_ADC_EXTERNAL_CH9
  *           @arg @ref FL_ADC_EXTERNAL_CH10
  *           @arg @ref FL_ADC_EXTERNAL_CH11
  *           @arg @ref FL_ADC_EXTERNAL_CH12
  *           @arg @ref FL_ADC_EXTERNAL_CH13
  *           @arg @ref FL_ADC_EXTERNAL_CH14
  *           @arg @ref FL_ADC_EXTERNAL_CH15
  *           @arg @ref FL_ADC_EXTERNAL_CH16
  *           @arg @ref FL_ADC_EXTERNAL_CH17
  *           @arg @ref FL_ADC_EXTERNAL_CH18
  *           @arg @ref FL_ADC_EXTERNAL_CH19
  *           @arg @ref FL_ADC_EXTERNAL_CH20
  *           @arg @ref FL_ADC_EXTERNAL_CH21
  *           @arg @ref FL_ADC_EXTERNAL_CH22
  *           @arg @ref FL_ADC_EXTERNAL_CH23
  *           @arg @ref FL_ADC_INTERNAL_TS
  *           @arg @ref FL_ADC_INTERNAL_AVREF
  *           @arg @ref FL_ADC_INTERNAL_DAC
  *           @arg @ref FL_ADC_INTERNAL_TSICAP
  *           @arg @ref FL_ADC_INTERNAL_VREFP
  *           @arg @ref FL_ADC_INTERNAL_VREFN_FAST
  *           @arg @ref FL_ADC_INTERNAL_VREFN_SLOW
  * @retval   None
  */
__STATIC_INLINE void FL_ADC_ClearFlag_ChannelEndOfConversion(ADC_Type *ADCx, uint32_t channel)
{
    SET_BIT(ADCx->CHISR, ((channel & 0xffffffff) << 0x0U));
}

/**
  * @brief    Get Channel ID of Conversion Result
  * @rmtoll   CHDMA_DR    CHID    FL_ADC_GetConversionChannelID
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_ADC_GetConversionChannelID(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CHDMA_DR, ADC_CHDMA_DR_CHID_Msk));
}

/**
  * @brief    Get ADC Conversion Result
  * @rmtoll   CHDMA_DR    RESULT    FL_ADC_GetConversionResult
  * @param    ADCx ADC instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_ADC_GetConversionResult(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CHDMA_DR, ADC_CHDMA_DR_RESULT_Msk));
}

/**
  * @brief    Get EXTERNAL_CH0 Conversion Data
  * @rmtoll   CH0DR    RESULT    FL_ADC_ReadExternalCH0_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH0_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH0DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH1 Conversion Data
  * @rmtoll   CH1DR    RESULT    FL_ADC_ReadExternalCH1_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH1_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH1DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH2 Conversion Data
  * @rmtoll   CH2DR    RESULT    FL_ADC_ReadExternalCH2_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH2_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH2DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH3 Conversion Data
  * @rmtoll   CH3DR    RESULT    FL_ADC_ReadExternalCH3_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH3_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH3DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH4 Conversion Data
  * @rmtoll   CH4DR    RESULT    FL_ADC_ReadExternalCH4_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH4_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH4DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH5 Conversion Data
  * @rmtoll   CH5DR    RESULT    FL_ADC_ReadExternalCH5_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH5_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH5DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH6 Conversion Data
  * @rmtoll   CH6DR    RESULT    FL_ADC_ReadExternalCH6_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH6_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH6DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH7  Conversion Data
  * @rmtoll   CH7DR    RESULT    FL_ADC_ReadExternalCH7_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH7_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH7DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH8  Conversion Data
  * @rmtoll   CH8DR    RESULT    FL_ADC_ReadExternalCH8_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH8_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH8DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH9  Conversion Data
  * @rmtoll   CH9DR    RESULT    FL_ADC_ReadExternalCH9_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH9_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH9DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH10  Conversion Data
  * @rmtoll   CH10DR    RESULT    FL_ADC_ReadExternalCH10_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH10_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH10DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH11  Conversion Data
  * @rmtoll   CH11DR    RESULT    FL_ADC_ReadExternalCH11_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH11_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH11DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH12  Conversion Data
  * @rmtoll   CH12DR    RESULT    FL_ADC_ReadExternalCH12_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH12_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH12DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH13  Conversion Data
  * @rmtoll   CH13DR    RESULT    FL_ADC_ReadExternalCH13_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH13_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH13DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH14  Conversion Data
  * @rmtoll   CH14DR    RESULT    FL_ADC_ReadExternalCH14_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH14_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH14DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH15  Conversion Data
  * @rmtoll   CH15DR    RESULT    FL_ADC_ReadExternalCH15_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH15_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH15DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH16  Conversion Data
  * @rmtoll   CH16DR    RESULT    FL_ADC_ReadExternalCH16_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH16_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH16DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH17  Conversion Data
  * @rmtoll   CH17DR    RESULT    FL_ADC_ReadExternalCH17_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH17_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH17DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH18  Conversion Data
  * @rmtoll   CH18DR    RESULT    FL_ADC_ReadExternalCH18_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH18_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH18DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH19  Conversion Data
  * @rmtoll   CH19DR    RESULT    FL_ADC_ReadExternalCH19_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH19_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH19DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH20  Conversion Data
  * @rmtoll   CH20DR    RESULT    FL_ADC_ReadExternalCH20_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH20_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH20DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH21  Conversion Data
  * @rmtoll   CH21DR    RESULT    FL_ADC_ReadExternalCH21_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH21_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH21DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH22  Conversion Data
  * @rmtoll   CH22DR    RESULT    FL_ADC_ReadExternalCH22_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH22_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH22DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get EXTERNAL_CH23  Conversion Data
  * @rmtoll   CH23DR    RESULT    FL_ADC_ReadExternalCH23_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadExternalCH23_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH23DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get INTERNAL_TS Conversion Data
  * @rmtoll   CH24DR    RESULT    FL_ADC_ReadInternalTS_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadInternalTS_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH24DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get INTERNAL_AVREF Conversion Data
  * @rmtoll   CH25DR    RESULT    FL_ADC_ReadInternalAVREF_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadInternalAVREF_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH25DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get INTERNAL_DAC Conversion Data
  * @rmtoll   CH26DR    RESULT    FL_ADC_ReadInternalDAC_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadInternalDAC_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH26DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get INTERNAL_TSICAP Conversion Data
  * @rmtoll   CH27DR    RESULT    FL_ADC_ReadInternalTSICAP_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadInternalTSICAP_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH27DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get INTERNAL_VREFP Conversion Data
  * @rmtoll   CH29DR    RESULT    FL_ADC_ReadInternalVREFP_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadInternalVREFP_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH29DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get INTERNAL_VREFN_FAST Conversion Data
  * @rmtoll   CH30DR    RESULT    FL_ADC_ReadInternalVREFNFAST_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadInternalVREFNFAST_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH30DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get INTERNAL_VREFN_SLOW Conversion Data
  * @rmtoll   CH31DR    RESULT    FL_ADC_ReadInternalVREFNLOW_ConversionData
  * @param    ADCx ADC instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_ADC_ReadInternalVREFNLOW_ConversionData(ADC_Type *ADCx)
{
    return (uint32_t)(READ_BIT(ADCx->CH31DR, (0xffffU << 0U)) >> 0U);
}

/**
  * @}
  */

/** @defgroup ADC_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_ADC_CommonDeInit(void);
FL_ErrorStatus FL_ADC_CommonInit(FL_ADC_CommonInitTypeDef *ADC_CommonInitStruct);
void FL_ADC_CommonStructInit(FL_ADC_CommonInitTypeDef *ADC_CommonInitStruct);
FL_ErrorStatus  FL_ADC_DeInit(ADC_Type *ADCx);
FL_ErrorStatus FL_ADC_Init(ADC_Type *ADCx, FL_ADC_InitTypeDef  *ADC_InitStruct,uint32_t ACQx_ID);
void FL_ADC_StructInit(FL_ADC_InitTypeDef *ADC_InitStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33HT0XXA_FL_ADC_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2024-01-22*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
